<a href="https://colab.research.google.com/github/hdb4427/python/blob/master/csv_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [0]:
import glob

In [3]:
path='/content/sample_data/'
for file_name in glob.glob(path+'*.csv'):
  print(file_name)

/content/sample_data/mnist_test.csv
/content/sample_data/california_housing_train.csv
/content/sample_data/mnist_train_small.csv
/content/sample_data/california_housing_test.csv

In [9]:
files ='/content/drive/My Drive/Colab Notebooks/score/'
files_list=glob.glob(files+'*.csv')
files_list

['/content/drive/My Drive/Colab Notebooks/score/D 학교출신 지원자.csv',
 '/content/drive/My Drive/Colab Notebooks/score/H 학교출신 지원자.csv',
 '/content/drive/My Drive/Colab Notebooks/score/E 학교출신 지원자.csv',
 '/content/drive/My Drive/Colab Notebooks/score/I 학교출신 지원자.csv',
 '/content/drive/My Drive/Colab Notebooks/score/C 학교출신 지원자.csv',
 '/content/drive/My Drive/Colab Notebooks/score/F 학교출신 지원자.csv',
 '/content/drive/My Drive/Colab Notebooks/score/G 학교출신 지원자.csv',
 '/content/drive/My Drive/Colab Notebooks/score/J 학교출신 지원자.csv',
 '/content/drive/My Drive/Colab Notebooks/score/B 학교출신 지원자.csv',
 '/content/drive/My Drive/Colab Notebooks/score/A 학교출신 지원자.csv']

In [0]:
a_data='/content/drive/My Drive/Colab Notebooks/score/A 학교출신 지원자.csv'

In [120]:
df=pd.read_csv(a_data, encoding='cp949')
df.head()

  출신고교     학번   이름  국어  수학  영어  과탐1  과탐2
0    A  30104  조매미  70  66  78   38   42
1    A  30115  김개미  71  77  89   15   20
2    A  30117  박모기  76  55  75   35   30
3    A  30120  최파리  69  66  51   15   36
4    A  30215  정땅벌  63  20  76   15   19

# map과 list

In [21]:
a=input('숫자입력: ')

숫자입력: 3242

In [23]:
type(a)

str

In [25]:
a=input('숫자입력: ')
a, type(a)

숫자입력: 231235

('231235', str)

In [26]:
list_a=list(a)
list_a

['2', '3', '1', '2', '3', '5']

In [28]:
a=input('숫자입력: ').split()
list_a=list(a)
print(list_a, type(list_a))

숫자입력: 2314
['2314'] <class 'list'>

In [32]:
a=input('숫자입력: ').split()

숫자입력: 2 3 4

In [38]:
list_a=list(a)
list_a, type(list_a)

(['2', '3', '4'], list)

In [0]:
list_num=list(map(int, list_a))

In [41]:
list_num

[2, 3, 4]

In [52]:
a=[]
a

[]

In [51]:
a.append(10)
a

[5, 5, 5, 5, 5, 5, 5]

In [0]:
stu=[]
for files in files_list:
  data = pd.read_csv(files, encoding='cp949')
  stu.append(data)

In [129]:
stu

[   출신고교     학번   이름  국어  수학  영어  과탐1  과탐2
 0     D  30109  김국진  81  88  81   35   35
 1     D  30124  김민종  66   7  77   23   34
 2     D  30206  김태희  69  30  80   16   32
 3     D  30212  문근영  83  92  82   38   40
 4     D  30218  박신혜  96  80  89   39   44
 5     D  30225  송은이  49  35  20   20   24
 6     D  30226  안정환  84  84  81   48   47
 7     D  30301  양세형  78  66  81   30   38
 8     D  30311   원빈  93  32  54   38   31
 9     D  30406  이민호  54  30  52   24   19
 10    D  30411  이정재  82  14  81   32   35
 11    D  30420  장미희  97  88  86   44   44
 12    D  30509  장동건  89  59  82   39   42
 13    D  30513  이순재  76  50  74   32   35
 14    D  30522  전현무  85  25  98   16   42
 15    D  30528  지석진  88  84  83   39   37
 16    D  30609  차승원  68  43  71   22   39
 17    D  30614  차태현  97  76  86   39   40
 18    D  30617  채시라  50  20  37   40   18
 19    D  30627  하희라  49  14  69   28   17
 20    D  30701  장근석  71  17  85   31   26
 21    D  30712   장혁  50  22  71   24   21
 22    D  30724  전지현  84  63  64   24   40
 23    D  30725  조세호  88  77  68   36   34
 24    D  30727  한예슬  70  18  70   32   18
 25    D  30804  한채영  86  60  68   31   37
 26    D  30810   현빈  80  57  64   38   42
 27    D  30816  김용만  87  55  55   50   50
 28    D  30820  김성령  74  53  59   26   40
 29    D  30903  김신영  80  33  62   15   32
 30    D  30906  김준현  32  32  48   18   18,
    출신고교     학번   이름  국어  수학   영어  과탐1  과탐2
 0     H  30801  강호동  46  12   41   31   15
 1     H  30802  김건모  45  15   36   13    5
 2     H  30803  김남주  83  13   61   26   34
 3     H  30804  김미숙  85  40   77   44   35
 4     H  30805  김병만  87  61   79   28   41
 5     H  30806  김우빈  87  17  100   40   33
 6     H  30807  남궁원  92  88   87   43   45
 7     H  30808  신동엽  87  92   89   50   49
 8     H  30809  심은하  90  61   70   41   38
 9     H  30810  이나영  92  79   76   44   41
 10    H  30811  이병헌  85  42   42   48   47
 11    H  30812  이서진  91  67   84   33   38
 12    H  30813  이영하  73  83   76   44   37
 13    H  30814  이종석  79  70   65   46   39
 14    H  30815  정준하  63  27   74   28   34
 15    H  30816  지창욱  75  17   94   44   38
 16    H  30817  최재성  49  22   46   13   12
 17    H  30818  황신혜  67  55   57   32   22
 18    H  30819  김수현  84  27   48   32   38
 19    H  30820  김종민  77  65   60   48   36
 20    H  30821  김혜수  41  17   14   37   14
 21    H  30822  김희선  70  26   67   30   29
 22    H  30823  김희애  91  29   79   48   44
 23    H  30824  박근형  83  67   71   30   31
 24    H  30825  박해진  71  46   49   29   37
 25    H  30826  송중기  68  48   66   42   35
 26    H  30827  송혜교  86  51   81   44   44
 27    H  30828   수애  87  55   55   50   50
 28    H  30829  유지인  74  53   59   26   40
 29    H  30731  윤정희  85  83   86   41   41
 30    H  30732  이민정  58  32   67   14   12
 31    H  30733  이영자  79  62   98   27   15,
    출신고교     학번   이름  국어  수학   영어  과탐1  과탐2
 0     E  30111  구본길  91  10   95   41   38
 1     E  30113  기보배  48  25   82   33   24
 2     E  30127  김경욱  72  66   73   32   42
 3     E  30214  김기훈  60  56   86   15   34
 4     E  30302  김동성  68  55   61   20   19
 5     E  30315  김미정  81  39  100   21   39
 6     E  30318  김소희  69  48   70   35   38
 7     E  30328  김영남  68  63   70   16   31
 8     E  30401  김우진  96  73   79   37   44
 9     E  30402  김재범  80  27   94   31   26
 10    E  30410  김조순  71  69   88   48   35
 11    E  30415  모태범  74  76   75   30   34
 12    E  30418  문대성  77  52   83   29   13
 13    E  30426  박성현  63  20   93   44   26
 14    E  30429  박승희  76  42   79   38   31
 15    E  30517  박인비  79  36   71   35   39
 16    E  30527  박태환  72  16   80   20   20
 17    E  30528  사재혁  83  75   83   43   30
 18    E  30529  송대남  50  29   68   26   22
 19    E  30530  심권호  47  16   83   22   40
 20    E  30614  심석희  91  80   88   41   37
 21    E  30616  양영자  87  15   90   41   40
 22    E  30707  양학순  80  70   85   44   48
 23    E  30710  안현수  85  41   87   41   34
 24    E  30716  유승민  48  21   80   42   17
 25    E  30717  유남규  88  73   86   44   47
 26    E  30815  이상화  46  20   43   21   16
 27    E  30826  이원희  90  81   80   37   40
 28    E  30827  이효정  88  70   88   47   45
 29    E  30827  장미란  58  34   69   33   36
 30    E  30902  장혜진  91  88   90   31   47
 31    E  30913  전기영  90  12   86   44   44,
    출신고교     학번   이름  국어  수학  영어  과탐1  과탐2
 0     I  30103  이물개  72  45  65   12   28
 1     I  30117  최표범  85  56  49   20   21
 2     I  30130  김팬더  89  56  71   20   28
 3     I  30205  조사자  78  57  75   35   42
 4     I  30210  오참새  67  21  47   18   22
 5     I  30213  김토끼  65  44  44   25   27
 6     I  30228  김돼지  54  34  57   16   15
 7     I  30320  최낙타  84  69  75   22   26
 8     I  30324  정악어  73  38  49    9   11
 9     I  30404  윤늑대  64  62  67   15   12
 10    I  30411  오염소  63  37  58   15   13
 11    I  30418  박사슴  76  68  58   28   24
 12    I  30425  박물범  95  80  94   40   44
 13    I  30515  황기린  76  67  70   35   37
 14    I  30526  정펭귄  52  61  42   26   25
 15    I  30527  최하마  80  47  64   26   21
 16    I  30528  김수달  76  70  71   24   23
 17    I  30617  정해달  80  88  64   31   22
 18    I  30618  박여우  81  88  69   37   31
 19    I  30621  박상어  74  51  65   31   27
 20    I  30625  김백조  78  64  83   37   28
 21    I  30711  문벌새  77  41  71   20   21
 22    I  30715  유거미  95  81  78   45   39
 23    I  30716  황고래  75  88  90   11   20
 24    I  30801  최불곰  92  77  74   20   33
 25    I  30812  김거북  80  93  90   49   50
 26    I  30817   김곰  81  66  45   19   34
 27    I  30819   최용  89  79  73   25   32
 28    I  30826  박쉬리  67  65  54   10   13
 29    I  30829  원곰치  77  67  82   26   27,
    출신고교     학번   이름   국어  수학  영어  과탐1  과탐2
 0     C  30110  강동원   69  40  68   34   19
 1     C  30115  강문영   59  70  73   23   29
 2     C  30116  고소영   75  45  63   13   29
 3     C  30123   공유   83  54  79   41   36
 4     C  30202   김숙   96  66  87   35   47
 5     C  30206  문채원   84  54  62   50   44
 6     C  30210  배수지   65  49  54   28   34
 7     C  30214  배용준   75  65  51   27   31
 8     C  30302  신성일   69  43  73   41   29
 9     C  30310  신세경   92  88  73   31   23
 10    C  30328  안성기   82  59  57   21   33
 11    C  30419  유아인   79  76  86   42   44
 12    C  30430  유재석   82  73  61   24   11
 13    C  30506  이수근   53  63  63   11   10
 14    C  30507  이승기  100  74  82   41   35
 15    C  30513  이효리   98  74  95   50   34
 16    C  30518  정형돈   92  72  82   31   28
 17    C  30522  최민수   75  46  68   11   21
 18    C  30527  최지우   87  84  89   40   41
 19    C  30605  한석규   69  54  62   15   29
 20    C  30612  강석우   84  84  94   44   36
 21    C  30620  강수연   63  54  44   20   22
 22    C  30623  고두심   83  54  57   17   36
 23    C  30710  권상우   70  73  61   11   14
 24    C  30721  김구라   94  51  89   35   39
 25    C  30728  김성주  100  67  85   38   37
 26    C  30805  지상렬   92  96  69   47   38
 27    C  30807  박주미   91  57  73   31   28
 28    C  30820  소지섭   53  74  38   23   27
 29    C  30905  손예진   97  84  86   38   30
 30    C  30906  신민아   80  69  68   39   36
 31    C  30912  신영균   86  89  50   36   33
 32    C  30919  유승호   62  53  59   11   15,
    출신고교     학번   이름   국어  수학  영어  과탐1  과탐2
 0     F  30102  이미연   84  74  61   32   37
 1     F  30118  이상민   84  12  73   38   10
 2     F  30124  이영애   82  70  68   34   34
 3     F  30130  이정길   64  13  92   14    6
 4     F  30203  이휘재   65  71  56   44   44
 5     F  30210  조인성   87  42  86   47   41
 6     F  30217  차인표   93  16  79   50   37
 7     F  30230  최수지   76  26  83   44   37
 8     F  30313  한지민  100  48  98   34   35
 9     F  30318  강호동   73  27  59   44   28
 10    F  30326  김건모   87  88  92   45   43
 11    F  30329  김남주   76  72  60   41   47
 12    F  30405  김미숙   88  92  80   37   29
 13    F  30406  김병만   84  96  79   42   45
 14    F  30409  김우빈   58  24  48   45   22
 15    F  30412  남궁원   76  17  89   34   16
 16    F  30415  신동엽   76  55  76   28   44
 17    F  30417  심은하   85  76  83   38   40
 18    F  30420  이나영   50  20  70   37   16
 19    F  30501  이병헌   72  65  87   35   25
 20    F  30527  이서진   86  43  67   33   47
 21    F  30618  이영하   88  60  70   46   40
 22    F  30723  이종석   70  36  63   16   24
 23    F  30812  정준하   82  18  64   31   34
 24    F  30818  지창욱   75  36  71   39   27
 25    F  30830  최재성   62  31  86   27   33
 26    F  30902  황신혜   76  15  75   30   28
 27    F  30903  김수현   75  71  92   44   48
 28    F  30907  김종민   62  34  62   46   26
 29    F  30914  김혜수   81  31  60   38   28
 30    F  30920  김희선   94  84  80   44   45
 31    F  30924  김희애   56  15  66   36   12,
    출신고교     학번   이름  국어  수학  영어  과탐1  과탐2
 0     G  30701  정우성  92  92  80   36   47
 1     G  30702  주진모  58  22  64   32   26
 2     G  30703  최불암  23  21  21   18   20
 3     G  30704  최수종  65  38  53   39   32
 4     G  30705  하정우  51  62  81   27   34
 5     G  30706  김준호  64  37  44   30   30
 6     G  30707  김혜자  90  50  69   30   30
 7     G  30708  데프콘  71  24  84   32   12
 8     G  30709  박나래  80  73  80   37   38
 9     G  30710  박수홍  81  88  80   45   48
 10    G  30711  서장훈  91  77  84   30   30
 11    G  30712  송승헌  70  47  82   32   30
 12    G  30713  양세찬  69  24  50   34    8
 13    G  30714  유병재  72  89  73   41   38
 14    G  30715  이경규  58  41  63   21   18
 15    G  30716  이광수  64  58  59   31   27
 16    G  30717  이연희  78  22  84   40   48
 17    G  30718  전인화  90  73  79   40   38
 18    G  30719  정윤희  57  64  59   27   29
 19    G  30720  한진희  79  58  83   41   40
 20    G  30721  김현주  95  77  68   45   42
 21    G  30722  하지원  98  94  91   45   45
 22    G  30723   고수  61  19  71   29   18
 23    G  30724  고현정  84  39  80   44   39
 24    G  30726  김지미  77  11  76   26   16
 25    G  30727  김하늘  73  26  55   31   30
 26    G  30728  노주현  71  40  94   34   30
 27    G  30729   문희  65  35  62   35   25
 28    G  30730  박명수  80  59  81   32   45
 29    G  30731  송일국  85  83  86   41   41
 30    G  30732  유동근  58  32  67   14   12
 31    G  30733  이국주  79  62  98   27   15,
    출신고교     학번   이름  국어  수학  영어  과탐1  과탐2
 0     J  30112  전병관  67  47  84   37   34
 1     J  30116  전이경  96  88  78   38   49
 2     J  30127  정지현  75  73  67   40   27
 3     J  30206  조민선  95  74  71   30   45
 4     J  30227  조윤정  88  88  80   44   47
 5     J  30309  조해리  84  22  82   31   36
 6     J  30323  진종오  70   5  66   45   27
 7     J  30410  최민경  88  61  63   36   27
 8     J  30415  최민호  82  57  61   22   40
 9     J  30420  최현주  81  44  93   48   43
 10    J  30425  현정화  57  21  84   24   33
 11    J  30522  홍정호  88  50  65   26   39
 12    J  30526  황영조  76  53  94   34   26
 13    J  30528  김은정  81  67  98   37   42
 14    J  30602  김경애  89  43  97   44   32
 15    J  30605  김선영  77  54  85   32   32
 16    J  30613  김영미  62  17  69   30   23
 17    J  30623  김초희  95  76  78   38   39
 18    J  30628  손흥민  84  59  79   40   19
 19    J  30718  황희찬  85  57  76   50   35
 20    J  30720  이승우  98  88  89   37   50
 21    J  30726  기성용  75  52  94   27   21
 22    J  30806  황의조  79  55  94   31   26
 23    J  30812  조현우  68  33  86   33   25
 24    J  30814  이강인  73  56  65   28   26
 25    J  30818  박주호  69  27  79   21   17
 26    J  30824  김영권  88  85  84   38   47
 27    J  30907  김승규  79  20  94   35   37
 28    J  30912  이재성  74  53  59   26   40
 29    J  30920  김신욱  85  83  86   41   41
 30    J  30926   이용  58  32  67   14   12
 31    J  30927  이청용  79  62  98   27   15,
    출신고교     학번   이름   국어  수학  영어  과탐1  과탐2
 0     B  30103  곽뱅어   91  50  82   27   37
 1     B  30122  성붕어   70  32  64   20   25
 2     B  30130  차우럭   87  77  91   34   28
 3     B  30204  주잉어   69  44  84   19   24
 4     B  30205  우뽈락   84  54  54   41   39
 5     B  30214  김멍게   85  75  88   18   20
 6     B  30215  신해삼   81  73  67   25   23
 7     B  30219  임방어   37  18  53   18   18
 8     B  30307  전연어   90  50  50   39   43
 9     B  30310  홍아귀   82  78  72   14   20
 10    B  30316  유장어   92  72  91   40   41
 11    B  30318  진전어   66  75  43   24   23
 12    B  30413  나홍어   67  27  50   12   18
 13    B  30415  김거위   65  55  45   14   23
 14    B  30419  정타조  100  85  85   46   46
 15    B  30503   박매   98  62  79   39   41
 16    B  30513  최황새   82  72  50   20   30
 17    B  30517   이닭   75  85  81   36   21
 18    B  30518  강제비   64  59  86   21   19
 19    B  30606  조멧새   84  55  86   22   29
 20    B  30611  윤원앙   84  70  54   38   30
 21    B  30619  장잉꼬   91  69  76   34   37
 22    B  30627  임솔개   37   9  10   20   15
 23    B  30704  심황태   79  77  91   39   47
 24    B  30710  노도미   77  17  47   41   39
 25    B  30714  정농어   59  76  61   26   23,
    출신고교     학번   이름  국어  수학  영어  과탐1  과탐2
 0     A  30104  조매미  70  66  78   38   42
 1     A  30115  김개미  71  77  89   15   20
 2     A  30117  박모기  76  55  75   35   30
 3     A  30120  최파리  69  66  51   15   36
 4     A  30215  정땅벌  63  20  76   15   19
 5     A  30228  오멸치  67  51  48   21   12
 6     A  30229  김꿀벌  93  77  78   33   44
 7     A  30305  윤여치  88  66  70   41   21
 8     A  30315  장곱등  86  66  84   35   38
 9     A  30317  임나방  73  77  75   32   25
 10    A  30319  한말벌  84  65  75   42   26
 11    A  30401  강나비  68  80  72   10   12
 12    A  30404  서삼치  88  65  86   41   37
 13    A  30421  신참치  98  92  85   44   35
 14    A  30428  권갈치  91  74  83   38   42
 15    A  30503  황넙치  73  70  76   35   33
 16    A  30512  안준치  84  77  66   19   23
 17    A  30518  송날치  90  56  61   20   33
 18    A  30529  전꽁치  79  46  68   34   34
 19    A  30622  유쥐치  95  85  91   38   32
 20    A  30707  고조기  57  69  72    8   18
 21    A  30709  문메기  72  77  91   18   33
 22    A  30803  손뿔돔  71  80  48   34   29
 23    A  30815  배옥돔  49  70  31   12   21
 24    A  30822  조황돔  84  88  76   37   37
 25    A  30824  백돌돔  83  88  80   30   30
 26    A  30827  허대구  95  70  67   35   29
 27    A  30901  유명태  87  69  96   37   40
 28    A  30928  남동태  91  50  80   29   26]



**concat**

In [0]:
a=[['a','b','c'], [10,20,30]]
b=[['d','e','f','add'], [-3,5,7,100]]

In [131]:
print(a)
print(b)

[['a', 'b', 'c'], [10, 20, 30]]
[['d', 'e', 'f', 'add'], [-3, 5, 7, 100]]

In [132]:
af=pd.DataFrame(a)
af

    0   1   2
0   a   b   c
1  10  20  30

In [133]:
bf=pd.DataFrame(b)
bf

    0  1  2    3
0   d  e  f  add
1  -3  5  7  100

In [0]:
af.columns=['A','B','C']
bf.columns=['A','B','C','D']

In [135]:
af

    A   B   C
0   a   b   c
1  10  20  30

In [136]:
bf

    A  B  C    D
0   d  e  f  add
1  -3  5  7  100

In [0]:
hap=pd.concat([af, bf])

In [140]:
hap

    A   B   C    D
0   a   b   c  NaN
1  10  20  30  NaN
0   d   e   f  add
1  -3   5   7  100

In [0]:
hap.index=[1,2,3,4]

In [142]:
hap

    A   B   C    D
1   a   b   c  NaN
2  10  20  30  NaN
3   d   e   f  add
4  -3   5   7  100

In [143]:
df=pd.concat(stu)
df[:-30]

   출신고교     학번   이름  국어  수학  영어  과탐1  과탐2
0     D  30109  김국진  81  88  81   35   35
1     D  30124  김민종  66   7  77   23   34
2     D  30206  김태희  69  30  80   16   32
3     D  30212  문근영  83  92  82   38   40
4     D  30218  박신혜  96  80  89   39   44
..  ...    ...  ...  ..  ..  ..  ...  ...
20    B  30611  윤원앙  84  70  54   38   30
21    B  30619  장잉꼬  91  69  76   34   37
22    B  30627  임솔개  37   9  10   20   15
23    B  30704  심황태  79  77  91   39   47
24    B  30710  노도미  77  17  47   41   39

[279 rows x 8 columns]

In [0]:
df.index=range(1,310)

In [106]:
df.tail()

    출신고교     학번   이름  국어  수학  영어  과탐1  과탐2
286    A  30822  조황돔  84  88  76   37   37
287    A  30824  백돌돔  83  88  80   30   30
288    A  30827  허대구  95  70  67   35   29
289    A  30901  유명태  87  69  96   37   40
290    A  30928  남동태  91  50  80   29   26

In [111]:
df[47:57]

   출신고교     학번   이름  국어  수학  영어  과탐1  과탐2
48    A  30529  전꽁치  79  46  68   34   34
49    A  30622  유쥐치  95  85  91   38   32
50    A  30707  고조기  57  69  72    8   18
51    A  30709  문메기  72  77  91   18   33
52    A  30803  손뿔돔  71  80  48   34   29
53    A  30815  배옥돔  49  70  31   12   21
54    A  30822  조황돔  84  88  76   37   37
55    A  30824  백돌돔  83  88  80   30   30
56    A  30827  허대구  95  70  67   35   29
57    A  30901  유명태  87  69  96   37   40

In [147]:
df['변환점수']=df['국어']*0.2 +df['수학']*0.4+(df['과탐1']+df['과탐2'])*0.4
df

    출신고교     학번   이름  국어  수학  영어  과탐1  과탐2  변환점수
1      D  30109  김국진  81  88  81   35   35  79.4
2      D  30124  김민종  66   7  77   23   34  38.8
3      D  30206  김태희  69  30  80   16   32  45.0
4      D  30212  문근영  83  92  82   38   40  84.6
5      D  30218  박신혜  96  80  89   39   44  84.4
..   ...    ...  ...  ..  ..  ..  ...  ...   ...
305    A  30822  조황돔  84  88  76   37   37  81.6
306    A  30824  백돌돔  83  88  80   30   30  75.8
307    A  30827  허대구  95  70  67   35   29  72.6
308    A  30901  유명태  87  69  96   37   40  75.8
309    A  30928  남동태  91  50  80   29   26  60.2

[309 rows x 9 columns]

In [0]:
df['합격']=df['변환점수']>70

In [150]:
df['합격']

1       True
2      False
3      False
4       True
5       True
       ...
305     True
306     True
307     True
308     True
309    False
Name: 합격, Length: 309, dtype: bool

In [158]:
df.sort_values('변환점수', ascending=False).head(10)

    출신고교     학번   이름   국어  수학  영어  과탐1  과탐2  변환점수    합격
39     H  30808  신동엽   87  92  89   50   49  93.8  True
212    G  30722  하지원   98  94  91   45   45  93.2  True
121    I  30812  김거북   80  93  90   49   50  92.8  True
269    B  30419  정타조  100  85  85   46   46  90.8  True
152    C  30805  지상렬   92  96  69   47   38  90.8  True
172    F  30406  김병만   84  96  79   42   45  90.0  True
12     D  30420  장미희   97  88  86   44   44  89.8  True
243    J  30720  이승우   98  88  89   37   50  89.6  True
224    J  30116  전이경   96  88  78   38   49  89.2  True
227    J  30227  조윤정   88  88  80   44   47  89.2  True